toasterllc/MDCCode/Code/STM32/STApp/Source/main.cpp
static struct {
    QSPI::Config ICEWrite = {
        .mode       = QSPI::Mode::Single,
        .clkDivider = 5, // clkDivider: 5 -> QSPI clock = 21.3 MHz
        .align      = QSPI::Align::Byte,
    };
    
    QSPI::Config ICEApp = {
        .mode       = QSPI::Mode::Dual,
        .clkDivider = 1, // clkDivider: 1 -> QSPI clock = 64 MHz)
        .align      = QSPI::Align::Word,
    };
} _QSPIConfigs;

void _QSPISetConfig(const QSPI::Config& config) {
    _QSPI.setConfig(config);
    
    // We manually control chip-select
    _ICE_ST_SPI_CS_::Write(1);
    _ICE_ST_SPI_CS_::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_VERY_HIGH, 0);
}

template<>
void _ICE::Transfer(const Msg& msg, Resp* resp) {
    AssertArg((bool)resp == (bool)(msg.type & _ICE::MsgType::Resp));
    
    _ICE_ST_SPI_CS_::Write(0);
    if (resp) {
        _QSPI.read(_QSPICmd::ICEApp(msg, sizeof(*resp)), resp);
    } else {
        _QSPI.command(_QSPICmd::ICEApp(msg, 0));
    }
    _Scheduler::Wait([] { return _QSPI.ready(); });
    _ICE_ST_SPI_CS_::Write(1);
}

[[noreturn]]
static void _ICEError(uint16_t line) {
    _System::Abort();
}

// MARK: - MSP430

using _MSPTest = GPIO<GPIOPortI, GPIO_PIN_8>;
using _MSPRst_ = GPIO<GPIOPortF, GPIO_PIN_0>;
static MSP430JTAG<_MSPTest, _MSPRst_, _System::CPUFreqMHz> _MSP;

// MARK: - SD Card

//static bool _MSPConnect(bool unlockPins) {
//    constexpr uint16_t PM5CTL0Addr  = 0x0130;
//    
//    const auto mspr = _MSP.connect();
//    if (mspr != _MSP.Status::OK) return false;
//    
//    if (unlockPins) {
//        // Clear LOCKLPM5 in the PM5CTL0 register
//        // This is necessary to be able to control the GPIOs
//        _MSP.write(PM5CTL0Addr, 0x0010);
//    }
//    
//    return true;
//}
//
//static bool _SDSetPowerEnabled(bool en) {
//    constexpr uint16_t BITB         = 1<<0xB;
//    constexpr uint16_t VDD_SD_EN    = BITB;
//    constexpr uint16_t PADIRAddr    = 0x0204;
//    constexpr uint16_t PAOUTAddr    = 0x0202;
//    
//    const bool br = _MSPConnect(true);
//    if (!br) return false;
//    
//    const uint16_t PADIR = _MSP.read(PADIRAddr);
//    const uint16_t PAOUT = _MSP.read(PAOUTAddr);
//    _MSP.write(PADIRAddr, PADIR | VDD_SD_EN);
//    
//    if (en) {
//        _MSP.write(PAOUTAddr, PAOUT | VDD_SD_EN);
//    } else {
//        _MSP.write(PAOUTAddr, PAOUT & ~VDD_SD_EN);
//    }
//    
//    _MSPDisconnect(false); // Don't allow MSP to run
//    
//    // The TPS22919 takes 1ms for VDD to reach 2.8V (empirically measured)
//    _Scheduler::Sleep(_Scheduler::Ms(2));
//    
//    return true;
//}

[[noreturn]]
static void _SDError(uint16_t line) {
    _System::Abort();
}

//static bool _ImgSetPowerEnabled(bool en) {
//    constexpr uint16_t BIT0             = 1<<0;
//    constexpr uint16_t BIT2             = 1<<2;
//    constexpr uint16_t VDD_1V8_IMG_EN   = BIT0;
//    constexpr uint16_t VDD_2V8_IMG_EN   = BIT2;
//    constexpr uint16_t PADIRAddr        = 0x0204;
//    constexpr uint16_t PAOUTAddr        = 0x0202;
//    
//    const bool br = _MSPConnect(true);
//    if (!br) return false;
//    
//    const uint16_t PADIR = _MSP.read(PADIRAddr);
//    const uint16_t PAOUT = _MSP.read(PAOUTAddr);
//    _MSP.write(PADIRAddr, PADIR | (VDD_2V8_IMG_EN | VDD_1V8_IMG_EN));
//    
//    if (en) {
//        _MSP.write(PAOUTAddr, PAOUT | (VDD_2V8_IMG_EN));
//        _Scheduler::Sleep(_Scheduler::Ms(1)); // 100us delay needed between power on of VAA (2V8) and VDD_IO (1V8)
//        _MSP.write(PAOUTAddr, PAOUT | (VDD_2V8_IMG_EN|VDD_1V8_IMG_EN));
//    
//    } else {
//        // No delay between 2V8/1V8 needed for power down (per AR0330CS datasheet)
//        _MSP.write(PAOUTAddr, PAOUT & ~(VDD_2V8_IMG_EN|VDD_1V8_IMG_EN));
//    }
//    
//    _MSPDisconnect(false); // Don't allow MSP to run
//    
//    #warning TODO: measure how long it takes for IMG rails to rise
//    // The TPS22919 takes 1ms for VDD_2V8_IMG VDD to reach 2.8V (empirically measured)
//    _Scheduler::Sleep(_Scheduler::Ms(2));
//    
//    return true;
//}

[[noreturn]]
static void _ImgError(uint16_t line) {
    _System::Abort();
}

// MARK: - Tasks

// _TaskUSBDataOut: reads `len` bytes from the DataOut endpoint and writes them to _Bufs
struct _TaskUSBDataOut {
    static void Start(size_t l) {
        // Make sure this task isn't busy
        Assert(!_Scheduler::Running<_TaskUSBDataOut>());
        
        static size_t len = 0;
        len = l;
        _Scheduler::Start<_TaskUSBDataOut>([] {
            for (;;) {
                _Scheduler::Wait([] { return _Bufs.wok(); });
                
                auto& buf = _Bufs.wget();
                if (!len) {
                    // Signal EOF when there's no more data to receive
                    buf.len = 0;
                    _Bufs.wpush();
                    break;
                }
                
                // Prepare to receive either `len` bytes or the buffer capacity bytes,
                // whichever is smaller.
                const size_t cap = _USB.CeilToMaxPacketSize(_USB.MaxPacketSizeOut(), std::min(len, sizeof(buf.data)));
                // Ensure that after rounding up to the nearest packet size, we don't
                // exceed the buffer capacity. (This should always be safe as long as
                // the buffer capacity is a multiple of the max packet size.)
                Assert(cap <= sizeof(buf.data));
                _USB.recv(Endpoints::DataOut, buf.data, cap);
                _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataOut); });
                
                // Never claim that we read more than the requested data, even if ceiling
                // to the max packet size caused us to read more than requested.
                const size_t recvLen = std::min(len, _USB.recvLen(Endpoints::DataOut));
                len -= recvLen;
                buf.len = recvLen;
                _Bufs.wpush();
            }
        });
    }
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{};
    
